HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_reg.h
/** \brief 528, Node 1 Timer B Transmit Trigger Register */
#define CAN0_N1_NT_BTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_BTTR*)0xF0208528u)
/** Alias (User Manual Name) for CAN0_N1_NT_BTTR.
* To use register names with standard convension, please use CAN0_N1_NT_BTTR.
*/
#define CAN0_NTBTTR1 (CAN0_N1_NT_BTTR)

/** \brief 52C, Node 1 Timer C Transmit Trigger Register */
#define CAN0_N1_NT_CTTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_CTTR*)0xF020852Cu)
/** Alias (User Manual Name) for CAN0_N1_NT_CTTR.
* To use register names with standard convension, please use CAN0_N1_NT_CTTR.
*/
#define CAN0_NTCTTR1 (CAN0_N1_NT_CTTR)

/** \brief 530, Node 1 Timer Receive Timeout Register */
#define CAN0_N1_NT_RTR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NT_RTR*)0xF0208530u)
/** Alias (User Manual Name) for CAN0_N1_NT_RTR.
* To use register names with standard convension, please use CAN0_N1_NT_RTR.
*/
#define CAN0_NTRTR1 (CAN0_N1_NT_RTR)

/** \brief 540, Node 1 Port Control Register */
#define CAN0_N1_NPCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NPCR*)0xF0208540u)
/** Alias (User Manual Name) for CAN0_N1_NPCR.
* To use register names with standard convension, please use CAN0_N1_NPCR.
*/
#define CAN0_NPCR1 (CAN0_N1_NPCR)

/** \brief 600, Core Release Register 1 */
#define CAN0_N1_CREL /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CREL*)0xF0208600u)
/** Alias (User Manual Name) for CAN0_N1_CREL.
* To use register names with standard convension, please use CAN0_N1_CREL.
*/
#define CAN0_CREL1 (CAN0_N1_CREL)

/** \brief 604, Endian Register 1 */
#define CAN0_N1_ENDN /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ENDN*)0xF0208604u)
/** Alias (User Manual Name) for CAN0_N1_ENDN.
* To use register names with standard convension, please use CAN0_N1_ENDN.
*/
#define CAN0_ENDN1 (CAN0_N1_ENDN)

/** \brief 60C, Data Bit Timing & Prescaler Register 1 */
#define CAN0_N1_DBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_DBTP*)0xF020860Cu)
/** Alias (User Manual Name) for CAN0_N1_DBTP.
* To use register names with standard convension, please use CAN0_N1_DBTP.
*/
#define CAN0_DBTP1 (CAN0_N1_DBTP)

/** \brief 610, Test Register 1 */
#define CAN0_N1_TEST /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TEST*)0xF0208610u)
/** Alias (User Manual Name) for CAN0_N1_TEST.
* To use register names with standard convension, please use CAN0_N1_TEST.
*/
#define CAN0_TEST1 (CAN0_N1_TEST)

/** \brief 614, RAM Watchdog 1 */
#define CAN0_N1_RWD /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RWD*)0xF0208614u)
/** Alias (User Manual Name) for CAN0_N1_RWD.
* To use register names with standard convension, please use CAN0_N1_RWD.
*/
#define CAN0_RWD1 (CAN0_N1_RWD)

/** \brief 618, CC Control Register 1 */
#define CAN0_N1_CCCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_CCCR*)0xF0208618u)
/** Alias (User Manual Name) for CAN0_N1_CCCR.
* To use register names with standard convension, please use CAN0_N1_CCCR.
*/
#define CAN0_CCCR1 (CAN0_N1_CCCR)

/** \brief 61C, Nominal Bit Timing & Prescaler Register 1 */
#define CAN0_N1_NBTP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NBTP*)0xF020861Cu)
/** Alias (User Manual Name) for CAN0_N1_NBTP.
* To use register names with standard convension, please use CAN0_N1_NBTP.
*/
#define CAN0_NBTP1 (CAN0_N1_NBTP)

/** \brief 620, Timestamp Counter Configuration 1 */
#define CAN0_N1_TSCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCC*)0xF0208620u)
/** Alias (User Manual Name) for CAN0_N1_TSCC.
* To use register names with standard convension, please use CAN0_N1_TSCC.
*/
#define CAN0_TSCC1 (CAN0_N1_TSCC)

/** \brief 624, Timestamp Counter Value 1 */
#define CAN0_N1_TSCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TSCV*)0xF0208624u)
/** Alias (User Manual Name) for CAN0_N1_TSCV.
* To use register names with standard convension, please use CAN0_N1_TSCV.
*/
#define CAN0_TSCV1 (CAN0_N1_TSCV)

/** \brief 628, Timeout Counter Configuration 1 */
#define CAN0_N1_TOCC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCC*)0xF0208628u)
/** Alias (User Manual Name) for CAN0_N1_TOCC.
* To use register names with standard convension, please use CAN0_N1_TOCC.
*/
#define CAN0_TOCC1 (CAN0_N1_TOCC)

/** \brief 62C, Timeout Counter Value 1 */
#define CAN0_N1_TOCV /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TOCV*)0xF020862Cu)
/** Alias (User Manual Name) for CAN0_N1_TOCV.
* To use register names with standard convension, please use CAN0_N1_TOCV.
*/
#define CAN0_TOCV1 (CAN0_N1_TOCV)

/** \brief 640, Error Counter Register 1 */
#define CAN0_N1_ECR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ECR*)0xF0208640u)
/** Alias (User Manual Name) for CAN0_N1_ECR.
* To use register names with standard convension, please use CAN0_N1_ECR.
*/
#define CAN0_ECR1 (CAN0_N1_ECR)

/** \brief 644, Protocol Status Register 1 */
#define CAN0_N1_PSR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_PSR*)0xF0208644u)
/** Alias (User Manual Name) for CAN0_N1_PSR.
* To use register names with standard convension, please use CAN0_N1_PSR.
*/
#define CAN0_PSR1 (CAN0_N1_PSR)

/** \brief 648, Transmitter Delay Compensation Register 1 */
#define CAN0_N1_TDCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TDCR*)0xF0208648u)
/** Alias (User Manual Name) for CAN0_N1_TDCR.
* To use register names with standard convension, please use CAN0_N1_TDCR.
*/
#define CAN0_TDCR1 (CAN0_N1_TDCR)

/** \brief 650, Interrupt Register 1 */
#define CAN0_N1_IR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IR*)0xF0208650u)
/** Alias (User Manual Name) for CAN0_N1_IR.
* To use register names with standard convension, please use CAN0_N1_IR.
*/
#define CAN0_IR1 (CAN0_N1_IR)

/** \brief 654, Interrupt Enable 1 */
#define CAN0_N1_IE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_IE*)0xF0208654u)
/** Alias (User Manual Name) for CAN0_N1_IE.
* To use register names with standard convension, please use CAN0_N1_IE.
*/
#define CAN0_IE1 (CAN0_N1_IE)

/** \brief 680, Global Filter Configuration 1 */
#define CAN0_N1_GFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_GFC*)0xF0208680u)
/** Alias (User Manual Name) for CAN0_N1_GFC.
* To use register names with standard convension, please use CAN0_N1_GFC.
*/
#define CAN0_GFC1 (CAN0_N1_GFC)

/** \brief 684, Standard ID Filter Configuration 1 */
#define CAN0_N1_SIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_SIDFC*)0xF0208684u)
/** Alias (User Manual Name) for CAN0_N1_SIDFC.
* To use register names with standard convension, please use CAN0_N1_SIDFC.
*/
#define CAN0_SIDFC1 (CAN0_N1_SIDFC)

/** \brief 688, Extended ID Filter Configuration 1 */
#define CAN0_N1_XIDFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDFC*)0xF0208688u)
/** Alias (User Manual Name) for CAN0_N1_XIDFC.
* To use register names with standard convension, please use CAN0_N1_XIDFC.
*/
#define CAN0_XIDFC1 (CAN0_N1_XIDFC)

/** \brief 690, Extended ID AND Mask 1 */
#define CAN0_N1_XIDAM /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_XIDAM*)0xF0208690u)
/** Alias (User Manual Name) for CAN0_N1_XIDAM.
* To use register names with standard convension, please use CAN0_N1_XIDAM.
*/
#define CAN0_XIDAM1 (CAN0_N1_XIDAM)

/** \brief 694, High Priority Message Status 1 */
#define CAN0_N1_HPMS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_HPMS*)0xF0208694u)
/** Alias (User Manual Name) for CAN0_N1_HPMS.
* To use register names with standard convension, please use CAN0_N1_HPMS.
*/
#define CAN0_HPMS1 (CAN0_N1_HPMS)

/** \brief 698, New Data 1 1 */
#define CAN0_N1_NDAT1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT1*)0xF0208698u)
/** Alias (User Manual Name) for CAN0_N1_NDAT1.
* To use register names with standard convension, please use CAN0_N1_NDAT1.
*/
#define CAN0_NDAT11 (CAN0_N1_NDAT1)

/** \brief 69C, New Data 2 1 */
#define CAN0_N1_NDAT2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_NDAT2*)0xF020869Cu)
/** Alias (User Manual Name) for CAN0_N1_NDAT2.
* To use register names with standard convension, please use CAN0_N1_NDAT2.
*/
#define CAN0_NDAT21 (CAN0_N1_NDAT2)

/** \brief 6A0, Rx FIFO 0 Configuration 1 */
#define CAN0_N1_RX_F0C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0C*)0xF02086A0u)
/** Alias (User Manual Name) for CAN0_N1_RX_F0C.
* To use register names with standard convension, please use CAN0_N1_RX_F0C.
*/
#define CAN0_RXF0C1 (CAN0_N1_RX_F0C)

/** \brief 6A4, Rx FIFO 0 Status 1 */
#define CAN0_N1_RX_F0S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0S*)0xF02086A4u)
/** Alias (User Manual Name) for CAN0_N1_RX_F0S.
* To use register names with standard convension, please use CAN0_N1_RX_F0S.
*/
#define CAN0_RXF0S1 (CAN0_N1_RX_F0S)

