HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCan_reg.h
/** \brief 6A8, Rx FIFO 0 Acknowledge 1 */
#define CAN0_N1_RX_F0A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F0A*)0xF02086A8u)
/** Alias (User Manual Name) for CAN0_N1_RX_F0A.
* To use register names with standard convension, please use CAN0_N1_RX_F0A.
*/
#define CAN0_RXF0A1 (CAN0_N1_RX_F0A)

/** \brief 6AC, Rx Buffer Configuration 1 */
#define CAN0_N1_RX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_BC*)0xF02086ACu)
/** Alias (User Manual Name) for CAN0_N1_RX_BC.
* To use register names with standard convension, please use CAN0_N1_RX_BC.
*/
#define CAN0_RXBC1 (CAN0_N1_RX_BC)

/** \brief 6B0, Rx FIFO 1 Configuration 1 */
#define CAN0_N1_RX_F1C /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1C*)0xF02086B0u)
/** Alias (User Manual Name) for CAN0_N1_RX_F1C.
* To use register names with standard convension, please use CAN0_N1_RX_F1C.
*/
#define CAN0_RXF1C1 (CAN0_N1_RX_F1C)

/** \brief 6B4, Rx FIFO 1 Status 1 */
#define CAN0_N1_RX_F1S /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1S*)0xF02086B4u)
/** Alias (User Manual Name) for CAN0_N1_RX_F1S.
* To use register names with standard convension, please use CAN0_N1_RX_F1S.
*/
#define CAN0_RXF1S1 (CAN0_N1_RX_F1S)

/** \brief 6B8, Rx FIFO 1 Acknowledge 1 */
#define CAN0_N1_RX_F1A /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_F1A*)0xF02086B8u)
/** Alias (User Manual Name) for CAN0_N1_RX_F1A.
* To use register names with standard convension, please use CAN0_N1_RX_F1A.
*/
#define CAN0_RXF1A1 (CAN0_N1_RX_F1A)

/** \brief 6BC, Rx Buffer/FIFO Element Size Configuration 1 */
#define CAN0_N1_RX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_RX_ESC*)0xF02086BCu)
/** Alias (User Manual Name) for CAN0_N1_RX_ESC.
* To use register names with standard convension, please use CAN0_N1_RX_ESC.
*/
#define CAN0_RXESC1 (CAN0_N1_RX_ESC)

/** \brief 6C0, Tx Buffer Configuration 1 */
#define CAN0_N1_TX_BC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BC*)0xF02086C0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BC.
* To use register names with standard convension, please use CAN0_N1_TX_BC.
*/
#define CAN0_TXBC1 (CAN0_N1_TX_BC)

/** \brief 6C4, Tx FIFO/Queue Status 1 */
#define CAN0_N1_TX_FQS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_FQS*)0xF02086C4u)
/** Alias (User Manual Name) for CAN0_N1_TX_FQS.
* To use register names with standard convension, please use CAN0_N1_TX_FQS.
*/
#define CAN0_TXFQS1 (CAN0_N1_TX_FQS)

/** \brief 6C8, Tx Buffer Element Size Configuration 1 */
#define CAN0_N1_TX_ESC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_ESC*)0xF02086C8u)
/** Alias (User Manual Name) for CAN0_N1_TX_ESC.
* To use register names with standard convension, please use CAN0_N1_TX_ESC.
*/
#define CAN0_TXESC1 (CAN0_N1_TX_ESC)

/** \brief 6CC, Tx Buffer Request Pending 1 */
#define CAN0_N1_TX_BRP /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BRP*)0xF02086CCu)
/** Alias (User Manual Name) for CAN0_N1_TX_BRP.
* To use register names with standard convension, please use CAN0_N1_TX_BRP.
*/
#define CAN0_TXBRP1 (CAN0_N1_TX_BRP)

/** \brief 6D0, Tx Buffer Add Request 1 */
#define CAN0_N1_TX_BAR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BAR*)0xF02086D0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BAR.
* To use register names with standard convension, please use CAN0_N1_TX_BAR.
*/
#define CAN0_TXBAR1 (CAN0_N1_TX_BAR)

/** \brief 6D4, Tx Buffer Cancellation Request 1 */
#define CAN0_N1_TX_BCR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCR*)0xF02086D4u)
/** Alias (User Manual Name) for CAN0_N1_TX_BCR.
* To use register names with standard convension, please use CAN0_N1_TX_BCR.
*/
#define CAN0_TXBCR1 (CAN0_N1_TX_BCR)

/** \brief 6D8, Tx Buffer Transmission Occurred 1 */
#define CAN0_N1_TX_BTO /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTO*)0xF02086D8u)
/** Alias (User Manual Name) for CAN0_N1_TX_BTO.
* To use register names with standard convension, please use CAN0_N1_TX_BTO.
*/
#define CAN0_TXBTO1 (CAN0_N1_TX_BTO)

/** \brief 6DC, Tx Buffer Cancellation Finished 1 */
#define CAN0_N1_TX_BCF /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCF*)0xF02086DCu)
/** Alias (User Manual Name) for CAN0_N1_TX_BCF.
* To use register names with standard convension, please use CAN0_N1_TX_BCF.
*/
#define CAN0_TXBCF1 (CAN0_N1_TX_BCF)

/** \brief 6E0, Tx Buffer Transmission Interrupt Enable 1 */
#define CAN0_N1_TX_BTIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BTIE*)0xF02086E0u)
/** Alias (User Manual Name) for CAN0_N1_TX_BTIE.
* To use register names with standard convension, please use CAN0_N1_TX_BTIE.
*/
#define CAN0_TXBTIE1 (CAN0_N1_TX_BTIE)

/** \brief 6E4, Tx Buffer Cancellation Finished Interrupt Enable 1 */
#define CAN0_N1_TX_BCIE /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_BCIE*)0xF02086E4u)
/** Alias (User Manual Name) for CAN0_N1_TX_BCIE.
* To use register names with standard convension, please use CAN0_N1_TX_BCIE.
*/
#define CAN0_TXBCIE1 (CAN0_N1_TX_BCIE)

/** \brief 6F0, Tx Event FIFO Configuration 1 */
#define CAN0_N1_TX_EFC /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFC*)0xF02086F0u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFC.
* To use register names with standard convension, please use CAN0_N1_TX_EFC.
*/
#define CAN0_TXEFC1 (CAN0_N1_TX_EFC)

/** \brief 6F4, Tx Event FIFO Status 1 */
#define CAN0_N1_TX_EFS /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFS*)0xF02086F4u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFS.
* To use register names with standard convension, please use CAN0_N1_TX_EFS.
*/
#define CAN0_TXEFS1 (CAN0_N1_TX_EFS)

/** \brief 6F8, Tx Event FIFO Acknowledge 1 */
#define CAN0_N1_TX_EFA /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_TX_EFA*)0xF02086F8u)
/** Alias (User Manual Name) for CAN0_N1_TX_EFA.
* To use register names with standard convension, please use CAN0_N1_TX_EFA.
*/
#define CAN0_TXEFA1 (CAN0_N1_TX_EFA)

/** \brief 900, Access Enable Register CAN Node 2 0 */
#define CAN0_N2_ACCENNODE0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_ACCENNODE0*)0xF0208900u)
/** Alias (User Manual Name) for CAN0_N2_ACCENNODE0.
* To use register names with standard convension, please use CAN0_N2_ACCENNODE0.
*/
#define CAN0_ACCENNODE20 (CAN0_N2_ACCENNODE0)

/** \brief 908, Start Address Node 2 */
#define CAN0_N2_STARTADR /*lint --e(923, 9078)*/ (*(volatile Ifx_CAN_N_STARTADR*)0xF0208908u)
/** Alias (User Manual Name) for CAN0_N2_STARTADR.
* To use register names with standard convension, please use CAN0_N2_STARTADR.
*/
#define CAN0_STARTADR2 (CAN0_N2_STARTADR)

